/*
   Localizable.strings - Italiano
   modizer

   Organized by screens and feature families
*/

// ================================
// MARK: - COMMON / GENERAL
// ================================

/* Common Actions */
"Yes" = "Sì";
"No" = "No";
"Ok" = "Ok";
"Cancel" = "Annulla";
"Close" = "Chiudi";
"Save" = "Salva";
"Delete" = "Elimina";
"Rename" = "Rinomina";
"Extract" = "Estrai";
"Cut" = "Taglia";
"Paste" = "Incolla";
"Create" = "Crea";
"Reset" = "Ripristina";

/* Common States */
"Loading" = "Caricamento";
"Extracting" = "Estrazione";
"Seeking" = "Ricerca";
"Seeking %d%%" = "Ricerca %d%%";
"Refreshing" = "Aggiornamento";
"Browsing" = "Navigazione";
"Cancelling..." = "Annullamento...";

/* Common Messages */
"Error" = "Errore";
"OK" = "OK";
"Warning" = "Attenzione";
"Do you want to reset to default value:\n" = "Vuoi ripristinare il valore predefinito:\n";


// ================================
// MARK: - BROWSER
// ================================

/* Browser Main Keys */
"Browser_LocalBrowsing_MainKey" = "Esplora file locali";
"Browser_LocalBrowsing_SubKey" = "Sfoglia, riproduci ed elimina file locali.";

"Browser_MODLAND_MainKey" = "Collezione MODLAND";
"Browser_MODLAND_SubKey" = "%d file scaricabili.";

"Browser_HVSC_MainKey" = "Collezione HVSC";
"Browser_HVSC_SubKey" = "%d file scaricabili.";

"Browser_Playlists_MainKey" = "Playlist";
"Browser_Playlists_SubKey" = "Organizza, crea, elimina e ascolta.";

"Browser_Favorites_MainKey" = "Preferiti";
"Browser_Favorites_SubKey" = "Ascolta i brani votati.";

"Browser_Most_played_MainKey" = "Più riprodotti";
"Browser_Most_played_SubKey" = "Ascolta i brani più riprodotti.";

"Browser_Web_MainKey" = "Web";
"Browser_Web_SubKey" = "Naviga su Internet e scarica musica.";

"Browser_WorldCharts_MainKey" = "Classifiche Mondiali";
"Browser_WorldCharts_SubKey" = "Top list e link di download.";

"Browser_WebVGM_MainKey" = "VGMRips";
"Browser_WebVGM_SubKey" = "Musica estratta da videogiochi";

"Browser_UserGuide_MainKey" = "Guida Utente";
"Browser_UserGuide_SubKey" = "Manuale, FAQ, suggerimenti.";

/* Browser Display Modes */
"GetAllEntries_MainKey" = "Ottieni tutte le voci mancanti";
"GetAllEntries_SubKey" = "Limitato alle prime 256 voci mancanti.";

"DisplayAll_MainKey" = "Elenca tutti per nome";
"DisplayAll_SubKey" = "Cartella corrente:";

"DisplayDir_MainKey" = "Lista/Cartella";
"DisplayDir_SubKey" = "Tutti ordinati per percorso:";

"DisplayAllPath_MainKey" = "Elenca tutti per percorso";
"DisplayAllPath_SubKey" = "Tutti ordinati per nome:";

/* Browser View Modes */
"Formats/Artists/Files" = "Formati/Artisti/File";
"Artists/Formats/Files" = "Artisti/Formati/File";
"Artists/Files" = "Artisti/File";
"Formats: %d entries." = "Formati: %d voci.";
"Artists: %d entries." = "Artisti: %d voci.";

/* Browser Stats */
"Played %d times." = "Riprodotto %d volte.";
"Played once." = "Riprodotto una volta.";
"Never played." = "Mai riprodotto.";
"%d files." = "%d file.";
"1 file." = "1 file.";
"Size: %dKB" = "Dimensione: %dKB";

/* Browser Messages */
"Browser not enough mem." = "Troppe voci, impossibile allocare memoria.";
"Browser not enough mem. Limited." = "Troppe voci, impossibile allocare memoria. Lista incompleta.";

/* File Operations */
"New folder" = "Nuova cartella";
"Enter folder name" = "Inserisci nome cartella";
"Nothing to paste" = "Niente da incollare";
"No file to extract or not supported archive format.\n" = "Nessun file da estrarre o formato archivio non supportato.\n";
"Cannot use iCloud as folder name" = "Impossibile usare iCloud come nome cartella";

"Issue %d while trying to delete entry.\n%@" = "Problema %d durante l'eliminazione della voce.\n%@";
"Issue %d while trying to renamefile.\n%@" = "Problema %d durante la rinominazione del file.\n%@";
"Issue %d while moving: %@.\n%@" = "Problema %d durante lo spostamento: %@.\n%@";
"Issue %d while creating folder\n%@" = "Problema %d durante la creazione della cartella\n%@";

"File is not available locally.\nTrigerring download from iCloud, please check in 'Files' application." = "File non disponibile localmente.\nAvvio download da iCloud, controlla nell'app 'File'.";

"unavailable" = "non disponibile";

// ================================
// MARK: - SEARCH
// ================================

/* Search States */
"Playlist (%d)" = "Playlist (%d)";
"Playlist/Search off" = "Playlist/Ricerca disattiva";

"Local (%d, limited to %d)" = "Locale (%d, limitato a %d)";
"Local (%d)" = "Locale (%d)";
"Local/Search off" = "Locale/Ricerca disattiva";

"Modland (%d, limited to %d)" = "Modland (%d, limitato a %d)";
"Modland (%d)" = "Modland (%d)";
"Modland/Search off" = "Modland/Ricerca disattiva";

"HVSC (%d, limited to %d)" = "HVSC (%d, limitato a %d)";
"HVSC (%d)" = "HVSC (%d)";
"HVSC/Search off" = "HVSC/Ricerca disattiva";

"ASMA (%d, limited to %d)"="ASMA (%d, limitato a %d)";
"ASMA (%d)"="ASMA (%d)";
"ASMA/Search off"="ASMA/Ricerca disattiva";

/* Search Messages */
"Searching Playlists..." = "Ricerca playlist...";
"Searching Local files..." = "Ricerca file locali...";
"Searching MODLAND..." = "Ricerca MODLAND...";
"Searching HVSC..." = "Ricerca HVSC...";

"Please enter at least 2 characters for your search." = "Inserisci almeno 2 caratteri per la ricerca.";
"Please activate at least 1 section for your search." = "Attiva almeno 1 sezione per la ricerca.";


// ================================
// MARK: - PLAYER / NOW PLAYING
// ================================

/* Player States */
"Now playing" = "In riproduzione";
"Now playing(%d)" = "In riproduzione(%d)";
"Most played" = "Più riprodotti";
"Favorites" = "Preferiti";
"Resuming last\nplayed file" = "Ripristino ultimo\nfile riprodotto";

/* Player Controls */
"Previous" = "Precedente";
"Previous file" = "File precedente";
"Next file" = "File successivo";
"Next" = "Successivo";
"Shuffle" = "Casuale";
"Voices control" = "Controllo voci";
"All voices" = "Tutte le voci";
"Clear 'Now Playing' queue" = "Svuota coda 'In riproduzione'";

/* Song Selection */
"Choose a subsong" = "Scegli un sottobrano";
"Choose a song" = "Scegli un brano";

/* Player Messages */
"Nothing currently playing. Please select a file." = "Nessuna riproduzione in corso. Seleziona un file.";
"File cannot be played. Skipping to next playable file." = "Impossibile riprodurre il file. Passo al file successivo riproducibile.";
"Too much entries! Playlist will be limited to %d first entries." = "Troppe voci! La playlist sarà limitata alle prime %d voci.";
"Playlist is full. Delete some entries to add more." = "Playlist piena. Elimina alcune voci per aggiungerne altre.";

/* Metadata */
"unknown_title" = "Titolo sconosciuto";
"unknown_album" = "Album sconosciuto";
"now_playing_format" = "Riproduzione: %@ da %@";


// ================================
// MARK: - PLAYLISTS
// ================================

/* Playlist Actions */
"New playlist" = "Nuova playlist";
"Create new playlist" = "Crea nuova playlist";
"Save current one" = "Salva quella corrente";
"Rename playlist" = "Rinomina playlist";
"Add to a playlist" = "Aggiungi a una playlist";
"Choose a playlist" = "Scegli una playlist";

/* Playlist Descriptions */
"Create a new empty playlist." = "Crea una nuova playlist vuota.";
"Create a playlist from currently played files." = "Crea una playlist dai file attualmente riprodotti.";
"Browse files" = "Sfoglia file";
"Add or remove entries from browser." = "Aggiungi o rimuovi voci dal browser.";
"Choose a new name." = "Scegli un nuovo nome.";

/* Playlist Confirmations */
"Are you sure you want to delete this playlist ?" = "Sei sicuro di voler eliminare questa playlist?";
"Are you sure you want to delete this entry ?" = "Sei sicuro di voler eliminare questa voce?";


// ================================
// MARK: - DOWNLOADS
// ================================

"Downloads" = "Download";
"Download queue: 1 file" = "Coda download: 1 file";
"Download queue: %d files" = "Coda download: %d file";
"No download in progress" = "Nessun download in corso";
"Downloaded %@" = "Scaricato %@";
"Downloading %@" = "Download %@";
"Cannot download from this URL." = "Impossibile scaricare da questo URL.";
"Could not add files. Please check manually with file browser (Local Browsing/Downloads)." = "Impossibile aggiungere file. Controlla manualmente con il browser file (Esplora locale/Download).";
"File already available locally. Do you want to download it again?" = "File già disponibile localmente. Vuoi scaricarlo di nuovo?";
"URL have to start with ftp:// or http://" = "L'URL deve iniziare con ftp:// o http://";
"Cannot connect to FTP." = "Impossibile connettersi a FTP.";


// ================================
// MARK: - DATABASE
// ================================

"Database created." = "Database creato.";
"Database will now be recreated. Please validate & wait." = "Il database verrà ora ricreato. Conferma e attendi.";
"Wrong database version: %d.%d. Will update to %d.%d. Please validate & wait." = "Versione database errata: %d.%d. Verrà aggiornata a %d.%d. Conferma e attendi.";
"No database found. Will create a new one. Please validate & wait..." = "Nessun database trovato. Ne verrà creato uno nuovo. Conferma e attendi...";


// ================================
// MARK: - COVERS / IMAGES
// ================================

"Image detected" = "Immagine rilevata";
"Choose_SaveCover" = "Salvare immagine come copertina per %@?";
"CoverFolder" = "Come copertina cartella";
"CoverFile" = "Come copertina file";
"Confirm_RemCurCovers" = "Rimuovere copertine attuali per %@ (cartella e file)?";


// ================================
// MARK: - SETTINGS - GENERAL
// ================================

/* Settings Sections */
"Settings_General" = "Generale";
"Settings_Player" = "Lettore";
"Settings_Display" = "Visualizzazione";
"Settings_Download" = "Download";
"Settings_FTP" = "FTP";
"Settings_PlaybackLib" = "Librerie riproduzione";
"Settings_Settings" = "Impostazioni";

/* Settings Presets */
"Settings_SettingsDefault" = "Predefinite";
"Settings_SettingsHigh" = "Alte";
"Settings_SettingsMed" = "Medie";
"Settings_SettingsLow" = "Basse";

"Confirm_SettingsDef" = "Sei sicuro di voler ripristinare le impostazioni con valori 'predefiniti'?";
"Confirm_SettingsHigh" = "Sei sicuro di voler ripristinare le impostazioni con valori 'alti'?";
"Confirm_SettingsMed" = "Sei sicuro di voler ripristinare le impostazioni con valori 'medi'?";
"Confirm_SettingsLow" = "Sei sicuro di voler ripristinare le impostazioni con valori 'bassi'?";

/* Global Player Settings */
"Search: simplified regexp ('.'->'\\.', '*'->'.*')" = "Ricerca: regexp semplificata ('.'->'\\.', '*'->'.*')";
"Resume position on launch" = "Riprendi posizione all'avvio";
"Notification" = "Notifica";
"Notification duration" = "Durata notifica";
"Disable screen auto lock" = "Disabilita blocco automatico schermo";
"No screen auto lock" = "Nessun blocco automatico schermo";
"Enable playback ratio" = "Abilita rapporto riproduzione";
"Playback ratio" = "Rapporto riproduzione";
"Default length" = "Durata predefinita";
"Default length %d:%.2d" = "Durata predefinita %d:%.2d";
"Fade-out time" = "Tempo dissolvenza";
"Silence Detection" = "Rilevamento silenzio";
"Stop song if silent for more than selected number of seconds. 0: off" = "Interrompi brano se silenzioso per più dei secondi selezionati. 0: disattivato";
"Will skip song if nothing is played for specified duration (0=off)" = "Salterà il brano se non viene riprodotto nulla per la durata specificata (0=disattivato)";
"Force mono" = "Forza mono";
"Panning" = "Bilanciamento";
"Panning value" = "Valore bilanciamento";
"Audio latency" = "Latenza audio";
"Audio latency in ms" = "Latenza audio in ms";
"Multi default action" = "Azione predefinita multi";
"Browse" = "Sfoglia";
"Archive/multi play mode" = "Modalità riproduzione archivio/multi";
"Entry"="Voce";

/* Archive Settings */
"Archive multi default action" = "Azione predefinita archivio multi";
"Archive multi play mode" = "Modalità riproduzione archivio multi";

/* Playlist Settings */
"Play/Enqueue action" = "Azione Riproduci/Accoda";
"Enqueue mode" = "Modalità accodamento";
"Default Action" = "Azione Predefinita";
"Play" = "Riproduci";
"Enqueue" = "Accoda";
"Enq.&Play" = "Accoda e Riproduci";
"First" = "Primo";
"Current" = "Corrente";
"Last" = "Ultimo";
"Enqueue position" = "Posizione accodamento";
"Post download action" = "Azione post-download";
"Nothing" = "Nessuna";

/* Display Settings */
"Background mode" = "Modalità background";
"Partial" = "Parziale";
"Full" = "Completa";
"Off=no background process, Partial=keep playing music, Full=keep app on in background" = "Off=nessun processo background, Parziale=continua riproduzione, Completa=mantieni app attiva in background";
"Long name truncate" = "Troncamento nomi lunghi";
"Head" = "Inizio";
"Mid." = "Centro";
"Tail" = "Fine";
"Filename as title" = "Nome file come titolo";

/* Local Files Settings */
"Auto. restore Samples folder" = "Ripristina automaticamente cartella Esempi";
"Send statistics" = "Invia statistiche";


// ================================
// MARK: - SETTINGS - DATABASE
// ================================

"Settings_DB" = "Database";
"Settings_CleanDB" = "Pulisci database";
"Settings_ResetPlCnt" = "Ripristina contatori riproduzione";
"Settings_ResetRatings" = "Ripristina valutazioni";
"Settings_ResetDB" = "Ripristina intero database";

"Confirm_DBClean" = "Avviare pulizia database (potrebbe richiedere tempo)?";
"Confirm_Reset_PlCnt" = "Sei sicuro di voler ripristinare tutti i contatori di riproduzione?";
"Confirm_Reset_Ratings" = "Sei sicuro di voler ripristinare tutte le valutazioni?";
"Confirm_ResetDB" = "Sei sicuro di voler ripristinare l'intero database? Playlist, valutazioni e contatori verranno eliminati.";


// ================================
// MARK: - SETTINGS - LOCAL FILES
// ================================

"Settings_LocalFiles" = "File locali";
"Settings_RecreateSamples" = "Ricrea cartella 'Esempi'";
"Settings_FormatDownloads" = "Formatta cartella 'Download'";
"Settings_RemCovers" = "Rimuovi copertine";
"Settings_UpdateFilesBackupFlag" = "Verifica filesystem";

"Confirm_RecreateSamples" = "Vuoi ricreare la cartella 'Esempi'.";
"Confirm_FormatDownloads" = "Vuoi rimuovere TUTTI i file dalla cartella Esplora locale/Web.";
"Confirm_CheckFiles" = "Vuoi eseguire un controllo del filesystem locale?";


// ================================
// MARK: - SETTINGS - PLUGINS
// ================================

/* AdPlug */
"OPL type" = "Tipo OPL";
"Stereo surround" = "Stereo surround";

/* GBSPlay */
"HP filter type" = "Tipo filtro HP";
"Highpass filter type" = "Tipo filtro passa-alto";

/* Game Music Emu (GME) */
"Stereo separation" = "Separazione stereo";
"Ignore silence" = "Ignora silenzio";
"Silence detection" = "Rilevamento silenzio";
"Equalizer" = "Equalizzatore";
"Bass" = "Bassi";
"Treble" = "Alti";

/* GSF */
"Sound quality" = "Qualità audio";
"Interpolation" = "Interpolazione";
"Low-pass filter" = "Filtro passa-basso";
"Echo" = "Eco";

/* Highly Complete (HC) */
"Resample quality" = "Qualità ricampionamento";
"Main enabled" = "Principale abilitato";
"Reverb enabled" = "Riverbero abilitato";

/* NSFPlay */
"NSFPLAY default length" = "Durata predefinita NSFPLAY";
"LPF strength" = "Intensità LPF";
"Min=off, default: 112" = "Min=off, predefinito: 112";
"HPF strength" = "Intensità HPF";
"Region" = "Regione";
"VRC7 Patches" = "Patch VRC7";
"Force IRQ" = "Forza IRQ";
"Quality" = "Qualità";

/* OpenMPT */
"Master volume" = "Volume principale";
"Sampling" = "Campionamento";
"Resampling" = "Ricampionamento";

/* SID */
"Engine" = "Motore";
"Filter" = "Filtro";
"Force loop" = "Forza loop";
"Clock" = "Clock";
"Model" = "Modello";
"Force 2nd SID" = "Forza 2° SID";
"Address 2nd" = "Indirizzo 2°";
"0xD420-0xD7FF or 0xDE00-0xDFFF" = "0xD420-0xD7FF o 0xDE00-0xDFFF";
"Force 3rd SID" = "Forza 3° SID";
"Address 3rd" = "Indirizzo 3°";

/* Timidity */
"Max loop" = "Loop massimi";
"MIDI polyphony" = "Polifonia MIDI";
"Amplification" = "Amplificazione";
"Chorus" = "Chorus";
"Reverb" = "Riverbero";
"Resample" = "Ricampiona";
"LP filter" = "Filtro LP";

/* UADE */
"Headphones" = "Cuffie";
"LED filter" = "Filtro LED";
"Normalization" = "Normalizzazione";
"Post FX" = "Post FX";
"Panning" = "Bilanciamento";
"Panning value" = "Valore bilanciamento";
"Gain" = "Guadagno";
"Gain value" = "Valore guadagno";
"Force NTSC" = "Forza NTSC";

/* VGMPlay */
"Prefer JTAG" = "Preferisci JTAG";
"YM2612 emulator" = "Emulatore YM2612";
"Nuked OPN2 option" = "Opzione Nuked OPN2";
"YMF262 emulator" = "Emulatore YMF262";
"YM3812 emulator" = "Emulatore YM3812";
"QSound emulator" = "Emulatore QSound";
"RF5C68 emulator" = "Emulatore RF5C68";

/* VGMStream */
"Max loop" = "Loop massimi";

/* XMP */
"Amiga 500 Filter" = "Filtro Amiga 500";


// ================================
// MARK: - SETTINGS - VISUALIZATIONS
// ================================

/* General FX */
"FX Alpha" = "Alpha FX";
"FX Fullscreen" = "FX Schermo intero";
"FX FPS" = "FPS FX";
"FX show info" = "Mostra info FX";
"Tech Info" = "Info tecniche";
"Show FPS and other infos (CPU, Resolution, ProjectM audio data)" = "Mostra FPS e altre info (CPU, Risoluzione, dati audio ProjectM)";
"FX Level of details" = "Livello dettagli FX";
"Low" = "Basso";
"Med" = "Medio";
"High" = "Alto";
"Slow FX limit" = "Limite FX lenti";
"Deactivate FX if too slow." = "Disattiva FX se troppo lenti.";
"Weak" = "Debole";
"Strong" = "Forte";
"Display song info" = "Visualizza info brano";
"When in fulllscreen, display song info when it changes. TL is Top Left, DR is Bottom Right, C is Center." = "A schermo intero, visualizza info brano quando cambia. TL è in alto a sinistra, DR in basso a destra, C è centro.";

/* ProjectM */
"ProjectM settings" = "Impostazioni ProjectM";
"ProjectM on/off" = "ProjectM on/off";
"Show preset label" = "Mostra etichetta preset";
"Auto switch presets mode" = "Modalità cambio automatico preset";
"Lock preset" = "Blocca preset";
"Time between preset" = "Tempo tra preset";
"Blend presets" = "Fonde preset";
"Blend time" = "Tempo fusione";
"Bundled presets" = "Preset inclusi";
"Custom presets" = "Preset personalizzati";
"Aspect ratio" = "Proporzioni";
"Mesh size X" = "Dimensione griglia X";
"Mesh size Y" = "Dimensione griglia Y";
"Hard cut enabled" = "Taglio netto abilitato";
"Hard cut min time" = "Tempo minimo taglio netto";
"Hard cut sensitivity" = "Sensibilità taglio netto";
"Beat sensitivity" = "Sensibilità battito";
"Permissive mode" = "Modalità permissiva";

/* Oscilloscope */
"Oscillo settings" = "Impostazioni oscilloscopio";
"FX mode" = "Modalità FX";
"Show label" = "Mostra etichetta";
"Label font size" = "Dimensione carattere etichetta";
"Show grid" = "Mostra griglia";
"Grid color" = "Colore griglia";
"Line width" = "Spessore linea";
"Mono color" = "Colore mono";
"Multi color set" = "Set colori multi";
"Reset all colors" = "Ripristina tutti i colori";
"Thin" = "Sottile";
"Medium" = "Medio";
"Thick" = "Spesso";
"Beefy" = "Extra spesso";

/* Piano Roll / MIDI */
"Piano roll" = "Piano roll";
"Activate Piano roll FX, standard or 'Synthesia' like" = "Attiva FX piano roll, standard o stile 'Synthesia'";
"Activate spark FX, colored or white" = "Attiva FX scintilla, colorato o bianco";
"Display voices labels" = "Visualizza etichette voci";
"Display octaves labels" = "Visualizza etichette ottave";
"MIDI pattern" = "Pattern MIDI";
"MIDI cut line" = "Linea taglio MIDI";
"MIDI bar style" = "Stile barre MIDI";
"MIDI bar vibrato" = "Vibrato barre MIDI";
"Piano 3D" = "Piano 3D";
"Piano cut line" = "Linea taglio piano";
"Piano color mode" = "Modalità colore piano";

/* Spectrum */
"3D spectrum" = "Spettro 3D";
"3D spectrum bloom" = "Bloom spettro 3D";
"Spectrum" = "Spettro";
"3D landscape" = "Paesaggio 3D";
"3D landscape bloom" = "Bloom paesaggio 3D";

/* MOD Pattern */
"MOD pattern" = "Pattern MOD";
"MOD pattern BG alpha" = "Alpha sfondo pattern MOD";
"MOD pattern vol bar" = "Barra volume pattern MOD";
"MOD pattern current line mode" = "Modalità linea corrente pattern MOD";
"MOD pattern font" = "Font pattern MOD";
"MOD pattern font size" = "Dimensione font pattern MOD";
"MOD pattern theme" = "Tema pattern MOD";


// ================================
// MARK: - WEB BROWSER
// ================================

"Browser_Welcome_Message" = "<b>Benvenuto nel browser web di Modizer!</b><br><br>Usa la barra degli indirizzi sopra per navigare o esplora i tuoi segnalibri.<br><br>Per usare un'immagine come copertina, copiala negli appunti con una pressione lunga (iOS) o clic destro (macOS).";
"Bookmarks" = "Segnalibri";


// ================================
// MARK: - ABOUT
// ================================

"About_Text" = "v4.2 © Yohann Magnien / YoyoFR\n\nContatti: mailto:modizerhelp@gmail.com\nWeb: https://modizer.app\n\nLogo di Modizer by Steve Miele.\n\nNumero di formati/estensioni file supportati: 1090.\n!PM!,04SW,208,2DX9,2PSF,2SF,2SFLIB,3DO,4,40A,40B,41A,50A,60A,61A,669,800,9TAV,A2M,AAC,AAM,AAX,ABK,AC1,AC1D,ACB,ACM,ACX,ADL,ADLIB,ADM,ADP,ADPCM,ADPCMX,ADS,ADSC,ADW,ADX,AFC,AFS2,AGD,AGI,AGSC,AHV,AHX,AI,AIF,AIF-LOOP,AIFC,AIFCL,AIFF,AIFFL,AIX,AKB,AL,AL2,ALP,AMC,AMD,AMF,AMS,AMTS,AO,AON,AON4,AON8,AP,APC,APE,AS0,AS3M,AS4,ASC,ASD,ASF,ASR,ASS,AST,AT3,AT9,ATSL,ATSL3,ATSL4,ATX,AUD,AUS,AVAL,AVP,AWB,AWC,AY,B1S,BAF,BAKA,BAM,BANK,BAO,BAR,BCSTM,BCWAV,BD,BD3,BDS,BDSP,BFC,BFSTM,BFWAV,BFWAVNSMBU,BG00,BGM,BGW,BH2PCM,BIK,BIK2,BIKA,BIN,BK2,BLK,BMDX,BMF,BMS,BNK,BNM,BNS,BNSF,BO2,BP,BP3,BRSTM,BRSTMSPM,BSF,BSI,BSND,BSS,BTSND,BVG,BWAV,BYTES,C64,C67,CAF,CAPDSP,CBD2,CC3,CCC,CD,CFF,CFN,CHAN,CHI,CHK,CHP,CIN,CKB,CKD,CKS,CM,CM3,CMC,CMF,CMR,CMS,CNK,COP,CORE,CP,CPK,CPLX,CPS,CRB,CSB,CSMP,CTRL,CUS,CUST,CUSTOM,CVS,CWAV,CXS,D00,DA,DAT,DATA,DAX,DB,DBM,DCS,DCT,DDSP,DE2,DEC,DFM,DH,DI,DIGI,DIVA,DL,DLM1,DLM2,DLN,DLT,DL_DELI,DM0,DM1,DM2,DMC,DMF,DMM,DMO,DMSG,DMU,DMU2,DNS,DODA,DP,DR0,DRO,DS2,DSB,DSC,DSF,DSFLIB,DSM,DSP,DSPW,DSQ,DSR,DSS,DST,DTK,DTM,DUM,DVI,DW,DWOLD,DXH,DZ,E4X,EA,EAM,EAS,EMFF,EMOD,EMS,EMSV6,ENM,ENO,ENS,ESV,ET1,EU,EUP,EX,EXA,EZW,FAG,FAR,FC,FC-BSI,FC-M,FC13,FC14,FC3,FC4,FCM,FDA,FDI,FFW,FILP,FLAC,FLX,FMB,FNK,FP,FRED,FSB,FSV,FT,FTC,FUZ,FUZZ,FW,FWAV,FWSE,G1L,GAM,GAMPLUS,GBR,GBS,GBTS,GCA,GCM,GCUB,GCW,GDM,GENH,GIN,GLUE,GM,GMC,GMS,GOT,GRAY,GSB,GSF,GSFLIB,GTD,GTR,GV,GWM,GYM,H4M,HA2,HAB,HBT,HCA,HD,HDR,HES,HGC1,HIP,HIP7,HIPC,HIS,HMC,HN,HPS,HRM,HRP,HRT,HRT!,HSC,HSF,HSP,HSQ,HST,HVL,HWAS,HX2,HX3,HXC,HXD,HXG,HXX,IAB,IADP,ICE,IDMSF,IDSP,IDVI,IDWAV,IDXMA,IFS,IKM,ILD,IMA,IMC,IMF,IMS,IMX,INSTR,INT,IS,IS14,IS20,ISB,ISD,ISWS,IT,IT1,ITL,IVAG,IVAUD,IVB,J2B,JAM,JBM,JC,JCB,JCBO,JD,JMF,JO,JOE,JP,JPN,JPND,JPO,JPOLD,JSTM,JT,KAT,KCES,KCEY,KEF,KEF7,KH,KM9,KNS,KOVS,KRAW,KRIS,KRS,KSM,KSS,KTAC,KTSL2ASBIN,KTSS,KVS,L,LAA,LAAC,LAIF,LAIFC,LAIFF,LASF,LAX,LBIN,LDS,LEG,LEP,LIN,LIQ,LM0,LM1,LM2,LM3,LM4,LM5,LM6,LM7,LME,LMP3,LMP4,LOGG,LOPUS,LP,LPCM,LPK,LPS,LRMB,LSE,LSF,LSTM,LWAV,LZS,M,M15,M2,M3U,M4A,M4V,MA,MAB,MAD,MAP,MATX,MAX,MBM,MC,MC3,MCA,MCADPCM,MCG,MCMD,MCMD_ORG,MCO,MCR,MD,MDAT,MDI,MDL,MDS,MDSP,MDST,MDX,MDY,MED,MEXXMP,MFP,MG,MGS,MI4,MIB,MIC,MID,MIDI,MIHB,MINI2SF,MINIDSF,MINIGSF,MININCSF,MINIPSF,MINIPSF2,MINIQSF,MINISNSF,MINISSF,MINIUSF,MJB,MK2,MKF,MKII,MKIIO,MKJ,ML,MM4,MM8,MMCMP,MMD0,MMD1,MMD2,MMD3,MMD4,MMDC,MMS,MNSTR,MO3,MOD,MOD15,MOD15_MST,MOD15_ST-IV,MOD15_UST,MOD_ADSC4,MOD_COMP,MOD_DOC,MOD_FLT4,MOD_NTK,MOD_NTK1,MOD_NTK2,MOD_NTKAMP,MOGG,MOK,MON,MON_OLD,MP3,MP4,MPD,MPDSP,MPF,MPG,MPK,MPRO,MPT,MPTM,MS,MSA,MSADPCM,MSB,MSC,MSD,MSF,MSO,MSP,MSS,MSV,MSVP,MT2,MTA2,MTAF,MTK,MTM,MTP2,MTR,MUG,MUG2,MUL,MUPS,MUS,MUSC,MUSX,MW,MWV,MXST,MYSPD,MZ,N64,NAAC,NCSF,NCSFLIB,NDP,NDS,NGCA,NLSD,NOISEPACKER2,NOISEPACKER3,NOP,NP,NP1,NP2,NP3,NPS,NPSF,NR,NRU,NSF,NSFE,NSOPUS,NST,NTP,NTPK,NUB,NUB2,NUS3AUDIO,NUS3BANK,NWA,NWAV,NXA,OCTAMED,OGG,OGL,OKT,OMU,ONE,OPI,OPUS,OPUSX,OPX,ORG,OSP,OTM,OVB,OVI,OXM,OZI,P,P00,P10,P21,P2BT,P30,P3D,P40A,P40B,P41A,P4X,P50A,P5A,P5X,P60,P60A,P61,P61A,P6X,P86,PAP,PAST,PCD,PCM,PDT,PDX,PFLT,PHA,PIN,PIS,PK,PLM,PM,PM0,PM01,PM1,PM10C,PM18A,PM2,PM20,PM4,PM40,PMB,PMZ,PNB,POLK,PONA,POS,POWT,PP10,PP20,PP21,PP30,PPC,PPK,PPM,PPS,PPZ,PR1,PR2,PRG,PROM,PRU,PRU1,PRU2,PRUN,PRUN1,PRUN2,PS,PS2STM,PSA,PSC,PSF,PSF2,PSF2LIB,PSFLIB,PSG,PSH,PSID,PSM,PSND,PSW,PT,PT1,PT2,PT3,PT36,PTCOP,PTM,PTTUNE,PUMA,PVI,PVP,PWR,PXA,PYG,PYGM,PYGMY,PZI,QC,QPA,QSF,QSFLIB,QTS,R,RAC,RAD,RAK,RAS,RAW,RH,RHO,RIFF,RIX,RJP,RK,RKB,RKV,RMT,RND,ROF,ROL,RPGMVO,RRDS,RSD,RSF,RSID,RSM,RSP,RSTM,RTM,RWAR,RWAV,RWS,RWSD,RWX,RXW,S-C,S14,S3M,S7G,S98,S98xxxxxxxxx,SA,SA-P,SA2,SAB,SAD,SAF,SAP,SAS,SAT,SA_OLD,SB,SB0,SB1,SB2,SB3,SB4,SB5,SB6,SB7,SBIN,SBK,SBR,SBV,SC,SC68,SCD,SCH,SCI,SCL,SCN,SCR,SCT,SCUMM,SD9,SDB,SDF,SDR,SDT,SEB,SED,SEG,SF0,SF2,SFL,SFM,SFS,SFX,SFX13,SFX2,SG,SGB,SGC,SGD,SGX,SID,SID1,SID2,SJS,SKT,SKYT,SL3,SLI,SM,SM0,SM1,SM2,SM3,SM4,SM5,SM6,SM7,SMC,SMK,SMN,SMP,SMPL,SMPRO,SMUS,SMV,SND,SNDH,SNDMON,SNDS,SNG,SNGW,SNK,SNR,SNS,SNSF,SNSFLIB,SNT,SNT!,SNU,SNX,SOC,SOD,SOG,SON,SONIC,SOP,SPC,SPD,SPK,SPL,SPM,SPS,SPSD,SPW,SQD,SQT,SQX,SS,SS2,SSF,SSFLIB,SSM,SSS,ST,ST1,ST2,ST26,ST3,ST30,STAR,STC,STER,STK,STM,STMA,STP,STPK,STR,STREAM,STRM,STS,STX,SUN,SVAG,SVG,SVS,SWAG,SWAV,SWD,SWITCH_AUDIO,SX,SXD,SXD1,SXD2,SXD3,SYN,SYNMOD,SZX,TD0,TEC,TF,TF0,TFC,TFD,TFE,TFHD1.5,TFHD7V,TFHDPRO,TFMX,TFMX1.5,TFMX7V,TFMXPRO,TGQ,TGV,THM,THN,THP,THX,TINY,TK5,TLZ,TLZP,TM2,TM8,TMC,TME,TMX,TP,TP1,TP2,TP3,TPU,TRA,TRC,TRD,TRO,TRONIC,TRS,TS,TUN,TW,TWO,TXT,TXTH,TXTP,TYDSP,UDS,UE4OPUS,ULT,ULW,UM3,UMX,UN2,UNIC,UNIC2,USF,USFLIB,UTK,UV,V0,V1,V2M,V2MZ,VA3,VAG,VAI,VAS,VAWX,VB,VBK,VDM,VDS,VGM,VGS,VGV,VGZ,VID,VIG,VIS,VMS,VOI,VP6,VPK,VS,VSF,VSS,VSV,VTX,VXN,WAA,WAC,WAD,WAF,WAM,WAS,WAV,WAVC,WAVE,WAVEBATCH,WAVM,WAY,WB,WB2,WBD,WD,WEM,WII,WLF,WMA,WMUS,WN,WOW,WP2,WPD,WSD,WSI,WSR,WUA,WV2,WV6,WVE,WVS,WVX,X,XA,XA2,XA30,XAD,XAG,XAN,XANN,XAU,XAV,XEN,XM,XMA,XMA2,XMD,XMU,XNA,XNB,XOPUS,XPK,XPS,XSE,XSEW,XSF,XSM,XSS,XVAG,XVAS,XWAV,XWB,XWC,XWM,XWMA,XWS,XWV,YDSP,YM,YMF,ZEN,ZIC,ZSD,ZSM,ZSS,ZWDSP,ZWV,ZXZIP\nLibrerie player integrate:\n- Adplug\n- Another Slight Atari Player(ASAP)\n- AtariSound\n- Eupmini\n- ffmpeg/mpg123/vorbis\n- Game Music Emu\n- FMPmini\n- Highly Complete\n- AHX/Hively tracker\n- LazyUSF\n- Libvgm\n- Mdxplay\n- NSFPlay\n- OpenMPT\n- PlayGSF\n- Pmdmini\n- PxTone / Organya\n- PT3Player\n- SC68\n- Sibplayfp\n- Snes9x/snsf\n- ST-Sound\n- Timidity(using Merlin_gold SF2 soundfont)\n- UADE\n- XSF (2SF, NCSF)\n- XMP\n-V2M tinyplayer\n- VGMStream\n- VIO2SF\n- WebSID\n- ZXTune\n\nDisclaimer:\nGli accessi Internet alle librerie Modland, HVSC e ASMA sono forniti come servizio as-is, senza garanzia di disponibilità e/o funzionalità. Utilizza questa applicazione a tuo rischio.";


// ================================
// MARK: - SUPPORT
// ================================

"Mail support" = "Supporto email";
"Contact support by email" = "Contatta il supporto via email";
"[Please describe your request below]" = "[Descrivi la tua richiesta qui sotto]";


// ================================
// MARK: - DONATION / TIPS
// ================================

"Thank You! ❤️" = "Grazie! ❤️";
"Send a tip to Modizer" = "Invia un contributo a Modizer";
"Support Modizer development" = "Sostieni lo sviluppo di Modizer";


// ================================
// MARK: - LAUNCH / INITIALIZATION
// ================================

"Cleaning DB & \nreseting settings" = "Pulizia DB e \nripristino impostazioni";
"First launch or issue encountered last time Modizer was running. Apply default settings?" = "Primo avvio o problema riscontrato l'ultima volta che Modizer era in esecuzione. Applicare impostazioni predefinite?";


// ================================
// ================================
// MARK: - SIRI / APP INTENTS
// ================================

/* Titoli degli intent */
"Play" = "Riproduci";
"Pause" = "Pausa";
"Stop" = "Stop";
"Next Song" = "Brano successivo";
"Previous Song" = "Brano precedente";
"Play Subsong" = "Riproduci sottobrano";
"Seek" = "Cerca";
"Set Infinite Loop" = "Imposta loop infinito";
"Set Loop Mode" = "Imposta modalità ripetizione";
"Set Shuffle Mode" = "Imposta modalità casuale";
"Toggle Shuffle" = "Attiva/disattiva casuale";
"Toggle Loop Mode" = "Attiva/disattiva ripetizione";
"Set Fullscreen mode" = "Imposta modalità schermo intero";
"Go the player view" = "Vai alla vista del lettore";
"Set FX" = "Imposta FX";
"Get Now Playing" = "Ottieni riproduzione corrente";
"Get Playlists" = "Ottieni playlist";
"Play some music" = "Riproduci musica";
"Play most played" = "Riproduci più riprodotti";
"Play favorites" = "Riproduci preferiti";
"Play Playlist" = "Riproduci playlist";
"Play Playlist By Name" = "Riproduci playlist per nome";

/* Descrizioni degli intent */
"Starts playing music in Modizer." = "Avvia la riproduzione musicale in Modizer.";
"Pauses music playback in Modizer." = "Mette in pausa la riproduzione musicale in Modizer.";
"Stops music playback in Modizer." = "Interrompe la riproduzione musicale in Modizer.";
"Skips to the next song in Modizer." = "Passa al brano successivo in Modizer.";
"Skips to the previous song in Modizer." = "Passa al brano precedente in Modizer.";
"Plays a specific subsong in the current file." = "Riproduce un sottobrano specifico nel file corrente.";
"Seeks to a specific position in the current song." = "Cerca una posizione specifica nel brano corrente.";
"Set the infinite loop mode in Modizer." = "Imposta la modalità loop infinito in Modizer.";
"Set the loop mode in Modizer." = "Imposta la modalità ripetizione in Modizer.";
"Set the shuffle mode in Modizer." = "Imposta la modalità casuale in Modizer.";
"Toggles shuffle mode in Modizer." = "Attiva/disattiva la modalità casuale in Modizer.";
"Toggles loop mode in Modizer." = "Attiva/disattiva la modalità ripetizione in Modizer.";
"Set Fullscreen mode on or off in Modizer." = "Attiva o disattiva la modalità schermo intero in Modizer.";
"Go the player view in Modizer." = "Vai alla vista del lettore in Modizer.";
"Set FX mode in Modizer." = "Imposta la modalità FX in Modizer.";
"Gets information about the currently playing song." = "Ottiene informazioni sul brano in riproduzione.";
"Gets the list of available playlists in Modizer." = "Ottiene l'elenco delle playlist disponibili in Modizer.";
"Random picks from available local titles in Modizer." = "Selezioni casuali tra i titoli locali disponibili in Modizer.";
"Most played titles from available local titles in Modizer." = "Titoli più riprodotti tra i titoli locali disponibili in Modizer.";
"Favorites titles from available local titles in Modizer." = "Titoli preferiti tra i titoli locali disponibili in Modizer.";
"Plays a specific playlist in Modizer. Note: For best results with voice commands, use 'Play Playlist By Name' instead." = "Riproduce una playlist specifica in Modizer. Nota: Per migliori risultati con i comandi vocali, usa 'Riproduci playlist per nome' invece.";
"Plays a playlist by name in Modizer. Recommended for voice commands." = "Riproduce una playlist per nome in Modizer. Consigliato per comandi vocali.";

/* Parametri */
"Subsong Index" = "Indice sottobrano";
"The index of the subsong to play" = "L'indice del sottobrano da riprodurre";
"Position (seconds)" = "Posizione (secondi)";
"The position to seek to in seconds" = "La posizione da cercare in secondi";
"Relative" = "Relativo";
"Whether to seek relative to current position" = "Se cercare in relazione alla posizione corrente";
"Infinite Loop Mode" = "Modalità loop infinito";
"0: off, 1: infinite loop" = "0: disattivato, 1: loop infinito";
"Repeat Mode" = "Modalità ripetizione";
"0: off, 1: loop current title, 2: loop playlist" = "0: disattivato, 1: ripeti titolo corrente, 2: ripeti playlist";
"Shuffle Mode" = "Modalità casuale";
"0: off, 1: choose only one title if file has subsongs or is an archive, 2: play all titles of a given file" = "0: disattivato, 1: scegli solo un titolo se il file ha sottobrani o è un archivio, 2: riproduci tutti i titoli di un dato file";
"Fullscreen mode" = "Modalità schermo intero";
"Activate (1) or disactivate (0) Fullscreen mode" = "Attiva (1) o disattiva (0) la modalità schermo intero";
"FX" = "FX";
"The FX to set" = "L'FX da impostare";
"FX Mode" = "Modalità FX";
"The mode to activate for the selected FX (0:off)" = "La modalità da attivare per l'FX selezionato (0:disattivato)";
"Playlist" = "Playlist";
"The playlist to play" = "La playlist da riprodurre";
"Start Index" = "Indice di partenza";
"The index of the song to start playing from (0-based)" = "L'indice del brano da cui iniziare la riproduzione (base 0)";
"Playlist Name" = "Nome playlist";
"The name of the playlist to play" = "Il nome della playlist da riprodurre";
"Which playlist would you like to play?" = "Quale playlist vorresti riprodurre?";

/* Messaggi di dialogo */
"play_playlist_dialog" = "Riproduzione playlist %@";
"Playlist not found. Use 'Get Playlists' to see available playlists." = "Playlist non trovata. Usa 'Ottieni playlist' per vedere le playlist disponibili.";
"No playlists found" = "Nessuna playlist trovata";

/* Nomi FX */
"ProjectM" = "ProjectM";
"Oscillo" = "Oscilloscopio";
"Piano roll" = "Rullo pianoforte";
"3D Piano" = "Piano 3D";
"Notes bars" = "Barre note";
"Tracker" = "Tracker";
"2D Spectrum" = "Spettro 2D";
"3D Spectrum" = "Spettro 3D";
"3D Landscape" = "Paesaggio 3D";

// ================================

"Get Now Playing" = "Ottieni In riproduzione";
"Which playlist would you like to play?" = "Quale playlist vuoi riprodurre?";


// ================================


// ================================
// MARK: - VOICE COMMANDS UI
// ================================

"Voice Commands" = "Comandi vocali";
"Siri voice commands for Modizer" = "Comandi vocali Siri per Modizer";
"Voice Commands: Playback" = "Riproduzione";
"Voice Commands: Navigation" = "Navigazione";
"Voice Commands: Playlists" = "Playlist";
"Voice Commands: Modes" = "Modalità";
// MARK: - TABS
// ================================

"Search" = "Cerca";
"More" = "Altro";
"Suspend" = "Sospendi";
"Clear all" = "Cancella tutto";
"Online" = "Online";


// ================================
// MARK: - MORE TAB
// ================================

"About" = "Info";
"Some general informations" = "Alcune informazioni generali";
"Settings" = "Impostazioni";
"Global, Visu, FTP & Plugins" = "Globali, Visu, FTP e Plugin";
"Maintenance" = "Manutenzione";
"Clean DB, Reset ratings, ..." = "Pulisci DB, Ripristina valutazioni, ...";


// ================================
// MARK: - ONLINE TAB / COLLECTIONS
// ================================

/* Section Headers */
"Collections" = "Collezioni";
"Browse Internet" = "Naviga su Internet";
"Games Music" = "Musica videogiochi";
"Mods & chiptunes" = "Mod e chiptune";
"Other" = "Altro";

/* Collections */
"MODLAND collection" = "Collezione MODLAND";
"HVSC collection" = "Collezione HVSC";
"ASMA collection" = "Collezione ASMA";
"JOSHW collection" = "Collezione JOSHW";
"VGMRips collection" = "Collezione VGMRips";
"SNESmusic collection" = "Collezione SNESmusic";
"SMS Power! collection" = "Collezione SMS Power!";
"ZXArt collection" = "Collezione ZXArt";

/* Collection Descriptions */
"%d entries" = "%d voci";
"Thousands of entries" = "Migliaia di voci";
"2K+ packs / 40K+ songs" = "2K+ pacchetti / 40K+ brani";
"1500+ sets / Super Nintendo/Famicom" = "1500+ set / Super Nintendo/Famicom";
"Master System & Game gear sets" = "Set Master System e Game Gear";
"ZX Spectrum" = "ZX Spectrum";

/* Internet */
"Modizer World Charts" = "Classifiche Mondiali Modizer";
"Web browser" = "Browser web";
"No internet connectivity or website down." = "Nessuna connessione Internet o sito non disponibile.";

// ================================
// MARK: - SETTINGS - FAMILIES & UI
// ================================

/* Settings Families */
"Global" = "Globale";
"Default Players" = "Lettori predefiniti";
"Visualizers" = "Visualizzatori";
"PR & NS colors settings" = "Impostazioni colori PR e NS";
"Plugins" = "Plugin";

/* Player Selection */
"MOD player" = "Lettore MOD";
"SAP player" = "Lettore SAP";
"SID player" = "Lettore SID";
"VGM player" = "Lettore VGM";
"YM player" = "Lettore YM";
"NSF player" = "Lettore NSF";
"PT3 player" = "Lettore PT3";
"GBS player" = "Lettore GBS";
"KSS player" = "Lettore KSS";
"2SF player" = "Lettore 2SF";
"MIDI player" = "Lettore MIDI";

/* Global Player Settings - Additional Descriptions */
"Only for plugins supporting this feature (GME, NSFPLAY, LIBVGM)" = "Solo per plugin che supportano questa funzione (GME, NSFPLAY, LIBVGM)";
"0=auto, delay rounded to a multiple of audio buffer size" = "0=auto, ritardo arrotondato a un multiplo della dimensione buffer audio";
"Limited: not for subsong" = "Limitato: non per sottobrani";
"Default value is 3s" = "Valore predefinito è 3s";
"Default action when selecting an archive or a multisong file" = "Azione predefinita quando si seleziona un archivio o un file multibrano";
"Play only selected entry or full archive/multisong file" = "Riproduci solo voce selezionata o archivio/file multibrano completo";
"Show Welcome screen" = "Mostra schermata Benvenuto";
"Adplug priority for module" = "Priorità Adplug per modulo";

/* FTP Settings */
"Server status" = "Stato server";
"FTP Server" = "Server FTP";
"Authorize anonymous" = "Autorizza anonimo";
"User" = "Utente";
"Password" = "Password";
"Port" = "Porta";

/* Online Settings */
"MODLAND URL" = "URL MODLAND";
"HVSC URL" = "URL HVSC";
"ASMA URL" = "URL ASMA";
"MODLAND Server" = "Server MODLAND";
"MODLAND cust.URL" = "URL personalizzato MODLAND";
"HVSC Server" = "Server HVSC";
"HVSC cust.URL" = "URL personalizzato HVSC";
"ASMA Server" = "Server ASMA";
"ASMA cust.URL" = "URL personalizzato ASMA";


// ================================
// MARK: - SETTINGS - ADDITIONAL PLUGIN SETTINGS
// ================================

/* Visualization - MOD Pattern */
"Patterns BG Alpha" = "Alpha sfondo pattern";
"Opacity of mod patterns view" = "Opacità vista pattern mod";
"MOD Color Theme" = "Tema colore MOD";
"MOD Current Line" = "Linea corrente MOD";
"MOD Volume bars" = "Barre volume MOD";
"MOD Pattern Font" = "Font pattern MOD";
"MOD Pattern Font Size" = "Dimensione font pattern MOD";

/* Visualization - Piano Roll / MIDI */
"Piano Roll FX" = "FX piano roll";
"PR/Spark FX" = "FX PR/Scintilla";
"Display voices label" = "Visualizza etichetta voci";
"Notes scroller FX" = "FX scorrimento note";
"NS/bars mode" = "Modalità NS/barre";
"NS/bars style" = "Stile NS/barre";
"Vibrato display" = "Visualizzazione vibrato";
"Piano FX" = "FX piano";
"Piano bars mode" = "Modalità barre piano";

/* Visualization - Spectrum */
"3D Sp.Bloom" = "Bloom spettro 3D";
"3D Land. Bloom" = "Bloom paesaggio 3D";
"0: off" = "0: off";

/* ProjectM Settings */
"ProjectM FX" = "FX ProjectM";
"Rendering quality: Max is pixel resolution, 1/2 is half, ..." = "Qualità rendering: Max è risoluzione pixel, 1/2 è metà, ...";
"Custom presets/textures should be copied in .projectm folder" = "Preset/texture personalizzati vanno copiati nella cartella .projectm";
"Display preset name" = "Visualizza nome preset";
"Lim: display and disappear quickly" = "Lim: visualizza e scompare rapidamente";
"Auto switch presets" = "Cambio automatico preset";
"Allow loading of milk file with script issues" = "Consenti caricamento file milk con problemi di script";
"Default is 15s" = "Predefinito è 15s";
"Default is 2.7s" = "Predefinito è 2.7s";
"Default value is 32" = "Valore predefinito è 32";
"Default value is 24" = "Valore predefinito è 24";
"Default value is 20" = "Valore predefinito è 20";
"Hardcut" = "Taglio netto";
"Hardcut triggers presets switch synchronized with beats." = "Taglio netto attiva cambio preset sincronizzato con i battiti.";
"Hardcut min time" = "Tempo minimo taglio netto";
"Preserve aspect ratio for compatible shaders." = "Preserva proporzioni per shader compatibili.";
"Default value is 1" = "Valore predefinito è 1";
"Hardcut sensitivity" = "Sensibilità taglio netto";

/* Oscilloscope Settings */
"Oscillo FX" = "FX oscilloscopio";
"Oscillo show labels" = "Mostra etichette oscilloscopio";
"Oscillo labels font size" = "Dimensione carattere etichette oscilloscopio";
"Oscillo show grid" = "Mostra griglia oscilloscopio";
"Oscillo line width" = "Spessore linea oscilloscopio";
"Reset all custom colors" = "Ripristina tutti i colori personalizzati";
"Multi color | System 1" = "Multi colore | Sistema 1";
"Multi color | System 2" = "Multi colore | Sistema 2";
"Multi color | System 3" = "Multi colore | Sistema 3";
"Multi color | System 4" = "Multi colore | Sistema 4";
"Multi color | System 5" = "Multi colore | Sistema 5";
"Multi color | System 6" = "Multi colore | Sistema 6";
"Multi color | System 7" = "Multi colore | Sistema 7";
"Multi color | System 8" = "Multi colore | Sistema 8";

/* Piano/MIDI Colors */
"Custom color 01" = "Colore personalizzato 01";
"Custom color 02" = "Colore personalizzato 02";
"Custom color 03" = "Colore personalizzato 03";
"Custom color 04" = "Colore personalizzato 04";
"Custom color 05" = "Colore personalizzato 05";
"Custom color 06" = "Colore personalizzato 06";
"Custom color 07" = "Colore personalizzato 07";
"Custom color 08" = "Colore personalizzato 08";
"Custom color 09" = "Colore personalizzato 09";
"Custom color 10" = "Colore personalizzato 10";
"Custom color 11" = "Colore personalizzato 11";
"Custom color 12" = "Colore personalizzato 12";
"Custom color 13" = "Colore personalizzato 13";
"Custom color 14" = "Colore personalizzato 14";
"Custom color 15" = "Colore personalizzato 15";
"Custom color 16" = "Colore personalizzato 16";
"Custom color 17" = "Colore personalizzato 17";
"Custom color 18" = "Colore personalizzato 18";
"Custom color 19" = "Colore personalizzato 19";
"Custom color 20" = "Colore personalizzato 20";
"Custom color 21" = "Colore personalizzato 21";
"Custom color 22" = "Colore personalizzato 22";
"Custom color 23" = "Colore personalizzato 23";
"Custom color 24" = "Colore personalizzato 24";
"Custom color 25" = "Colore personalizzato 25";
"Custom color 26" = "Colore personalizzato 26";
"Custom color 27" = "Colore personalizzato 27";
"Custom color 28" = "Colore personalizzato 28";
"Custom color 29" = "Colore personalizzato 29";
"Custom color 30" = "Colore personalizzato 30";
"Custom color 31" = "Colore personalizzato 31";
"Custom color 32" = "Colore personalizzato 32";

/* Plugin Settings - Libopenmpt */
"Libopenmpt" = "Libopenmpt";

/* Plugin Settings - GME */
"GME" = "GME";
"Will skip song if nothing is played for specified duration (0=off)" = "Salterà il brano se non viene riprodotto nulla per la durata specificata (0=disattivato)";

/* Plugin Settings - GSF */
"GSF" = "GSF";

/* Plugin Settings - NSFPLAY */
"NSFPLAY" = "NSFPLAY";
"Default length" = "Durata predefinita";
"Oversampling. Min=0, default: 10" = "Sovracampionamento. Min=0, predefinito: 10";
"Min=off, default: 112" = "Min=off, predefinito: 112";
"Max=off, default: 164" = "Max=off, predefinito: 164";
"1/2/3=NTSC/PAL/DENDY\n4/5/6=force NTSC/PAL/DENDY" = "1/2/3=NTSC/PAL/DENDY\n4/5/6=forza NTSC/PAL/DENDY";
"Forces IRQ capability for all NSFs, not just NSF2" = "Forza capacità IRQ per tutti gli NSF, non solo NSF2";
"APU unmute on reset" = "APU riattiva su reset";
"APU phase reset" = "Reset fase APU";
"APU non linear mixing" = "Mixaggio non lineare APU";
"APU swap duty 1/2" = "APU scambia duty 1/2";
"APU Initialize sweep unmute" = "APU inizializza riattivazione sweep";
"DMC enable $4011 writes" = "DMC abilita scritture $4011";
"DMC enable periodic noise" = "DMC abilita rumore periodico";
"DMC unmute on reset" = "DMC riattiva su reset";
"DMC anti clicking" = "DMC anti click";
"DMC non linear mixer" = "Mixer non lineare DMC";
"DMC randomize noise on reset" = "DMC randomizza rumore su reset";
"DMC mute triangle on pitch 0" = "DMC silenzia triangolo su pitch 0";
"prevents high frequency aliasing" = "previene aliasing alta frequenza";
"DMC rand. triangle" = "DMC triang. casuale";
"randomize triangle on reset" = "randomizza triangolo su reset";
"DMC reverse bits" = "DMC inverti bit";
"reverse bits of DPCM sample bytes" = "inverti bit dei byte campione DPCM";
"MMC5 non linear mixing" = "Mixaggio non lineare MMC5";
"MMC5 Phase reset" = "Reset fase MMC5";
"Reset phase counter after write $5003 and $5007" = "Resetta contatore fase dopo scrittura $5003 e $5007";
"FDS LP filter in Hz" = "Filtro LP FDS in Hz";
"Cutoff frequency (0Hz=off, 2000Hz=default)" = "Frequenza taglio (0Hz=off, 2000Hz=predefinito)";
"FDS reset \"phase\"" = "FDS reset \"fase\"";
"$4085 \"resets\" modular phase" = "$4085 \"resetta\" fase modulare";
"FDS write protect" = "Protezione scrittura FDS";
"write protect $8000-DFFF" = "proteggi scrittura $8000-DFFF";
"VRC7 Replace with OPLL" = "VRC7 sostituisci con OPLL";
"N163 Serial Multiplex mixing" = "Mixaggio Serial Multiplex N163";
"N163 Write Protect Phase" = "Fase protezione scrittura N163";
"N163 Limit Wavelength" = "Limita lunghezza d'onda N163";

/* Plugin Settings - ADPLUG */
"ADPLUG" = "ADPLUG";

/* Plugin Settings - HC (Highly Complete) */
"HC" = "HC";
"Only for HC plugin" = "Solo per plugin HC";

/* Plugin Settings - SID */
"SID" = "SID";
"Digiboost" = "Digiboost";

/* Plugin Settings - TIMIDITY */
"TIMIDITY" = "TIMIDITY";

/* Plugin Settings - UADE */
"UADE" = "UADE";
"Panning value" = "Valore bilanciamento";
"Gain value" = "Valore guadagno";

/* Plugin Settings - VGMPlay */
"VGMPLAY" = "VGMPLAY";

/* Plugin Settings - VGMStream */
"VGMSTREAM" = "VGMSTREAM";

/* Plugin Settings - XMP */
"XMP" = "XMP";

/* Plugin Settings - SEXYPSF */
"SEXYPSF" = "SEXYPSF";

/* Plugin Settings - GBSPlay */
"GBS" = "GBS";

/* Plugin Settings - STSOUND */
"STSOUND" = "STSOUND";

/* Plugin Settings - SC68 */
"SC68" = "SC68";

/* Additional Settings */
"Disable" = "Disabilita";
"Enter playlist name" = "Inserisci nome playlist";
"Ask" = "Chiedi";
"Play All" = "Riproduci Tutto";
"Single" = "Singolo";
"Archive" = "Archivio";
"On" = "On";
"Off" = "Off";
"Lim" = "Lim";

// ================================
// MARK: - PLAYLISTS - ADDITIONAL ENTRIES
// ================================

/* Playlist Menu Entries */
"Add a playlist" = "Aggiungi una playlist";
"Create a new playlist" = "Crea una nuova playlist";
"Now playing" = "In riproduzione";
"1 entry" = "1 voce";
"No entry" = "Nessuna voce";
"Random picks" = "Selezione casuale";
"Generate a randomized playlist" = "Genera una playlist casuale";
"Most played" = "Più riprodotti";
"Favorites" = "Preferiti";

/* Playlist Actions */
"Add/Remove files..." = "Aggiungi/Rimuovi file...";
"More actions..." = "Altre azioni...";
"Save as a new playlist" = "Salva come nuova playlist";

// ================================
// MARK: - WELCOME PAGES
// ================================

"Welcome to Modizer!\n" = "Benvenuto in Modizer!\n";
"Level up your library" = "Potenzia la tua libreria";
"Sound meets visuals." = "Il suono incontra la grafica.";
"Made with passion,\noffered for free." = "Creato con passione,\nofferto gratuitamente.";

/* Welcome Page Messages */
"Your gateway to retro and tracker music.\nPower up your device with legendary game tunes, iconic tracker modules, and timeless chiptune classics." = "Il tuo accesso alla musica retro e tracker.\nPotenzia il tuo dispositivo con leggendarie melodie di gioco, iconici moduli tracker e classici chiptune senza tempo.";

"Browse and stream from online catalogs, to complete your own collections.\nBuild, edit, and listen to playlists effortlessly." = "Sfoglia e ascolta in streaming dai cataloghi online, per completare le tue collezioni.\nCrea, modifica e ascolta playlist senza sforzo.";

"Unlock classic oscilloscope looks, spectrum bars, piano rolls, trackers view and ProjectM/Milkdrop FX. Let Modizer paint each track with motion and color." = "Sblocca l'aspetto classico dell'oscilloscopio, barre dello spettro, piano roll, vista tracker e FX ProjectM/Milkdrop. Lascia che Modizer dipinga ogni traccia con movimento e colore.";

"If you enjoy the app, tips are a great way to support its ongoing development.\nThank you for helping keep Modizer alive and evolving." = "Se ti piace l'app, i contributi sono un ottimo modo per supportarne lo sviluppo continuo.\nGrazie per aiutare a mantenere Modizer vivo e in evoluzione.";

"Skip" = "Salta";

// ================================
// MARK: - TIPS / DONATIONS
// ================================

/* Tips Screen */
"Support with a Tip" = "Sostieni con un contributo";
"Enjoy Modizer ?" = "Ti piace Modizer?";
"Your support helps keep Modizer running and ad-free!" = "Il tuo sostegno aiuta a mantenere Modizer attivo e senza pubblicità!";
"Already tipped so far" = "Già contribuito finora";
"Thank you for your support! ❤️" = "Grazie per il tuo sostegno! ❤️";

/* Tip Tiers */
"Coffee" = "Caffè";
"Coffee & Croissant" = "Caffè e Cornetto";
"Dinner" = "Cena";
"Loading..." = "Caricamento...";

/* Tip Actions */
"Confirm Tip" = "Conferma contributo";
"Send Tip" = "Invia contributo";
"Send a %@ tip for %@?" = "Inviare un contributo %@ per %@?";
"Tip" = "Contributo";

/* Tip Errors */
"Unable to load products. Please check your internet connection." = "Impossibile caricare i prodotti. Controlla la connessione Internet.";

/* Thank You Alert */
"Thank You! ❤️" = "Grazie! ❤️";
"Your support means everything! Thank you for helping keep Modizer running." = "Il tuo sostegno significa tutto! Grazie per aiutare a mantenere Modizer attivo.";

// ================================
// MARK: - MAINTENANCE SCREEN
// ================================

/* Maintenance Actions */
"Clean Database" = "Pulisci database";
"Clear 'Now Playing' queue" = "Svuota coda 'In riproduzione'";
"Recreate Samples folder" = "Ricrea cartella Esempi";
"Reset settings to default" = "Ripristina impostazioni predefinite";
"Remove current cover" = "Rimuovi copertina corrente";
"Reset Ratings" = "Ripristina valutazioni";
"Reset Played Counters" = "Ripristina contatori riproduzione";
"Reset Database" = "Ripristina database";
"Clear images cache" = "Svuota cache immagini";

/* Maintenance Messages */
"Settings reseted" = "Impostazioni ripristinate";
"Ratings reseted" = "Valutazioni ripristinate";
"Played Counters reseted" = "Contatori riproduzione ripristinati";
"Samples folder created" = "Cartella Esempi creata";
"Cache cleaned" = "Cache pulita";
"Database reseted" = "Database ripristinato";
"No cover to remove" = "Nessuna copertina da rimuovere";
"Cover removed" = "Copertina rimossa";
"Database cleaned" = "Database pulito";

/* Maintenance Confirmations */
"Are you sure you want to clean the DB, it might take a while ?" = "Sei sicuro di voler pulire il DB, potrebbe richiedere tempo?";
"Clean" = "Pulisci";
"Cleaning DB" = "Pulizia DB";
"Cancelling..." = "Annullamento...";

// ================================
// MARK: - PLAYERMENU
// ================================

"Close FX\nwindow" = "Chiudi finestra\nFX";
"All FX off" = "Tutti FX off";
"FX\nalpha" = "FX\nalpha";
"Show name\ntemp." = "Mostra nome\ntemp.";
"Show name" = "Mostra nome";
"Bundled\npresets" = "Preset\ninclusi";
"Custom\npresets" = "Preset\npersonalizzati";
"Blend\npresets" = "Fondi\npreset";
"Clear\nall" = "Cancella\ntutto";
"Select\nall" = "Seleziona\ntutto";
"Favorites" = "Preferiti";
"Expand" = "Espandi";
"Select\nlisted" = "Seleziona\nelencati";
"Remove\nlisted" = "Rimuovi\nelencati";
"Selected" = "Selezionato";
"Collapse" = "Comprimi";
"Labels" = "Etichette";
"Grid" = "Griglia";
"Voices\nlabels" = "Etichette\nvoci";
"Octaves\nlabels" = "Etichette\nottave";
"Volume\nbars" = "Barre\nvolume";
"Fixed bar" = "Barra fissa";
"BG\nopacity" = "Opacità\nsfondo";
"Bloom:\n%s" = "Bloom:\n%s";
"Thickness:\n%s" = "Spessore:\n%s";
"Font size\n%s" = "Dim. carattere\n%s";
"Font:\n%s" = "Font:\n%s";
"Info HUD:\n%s" = "HUD info:\n%s";
"Select active %s presets" = "Seleziona preset %s attivi";
"bundled" = "inclusi";
"custom" = "personalizzati";
"Select\ncustom\npresets" = "Seleziona\npreset\npersonalizzati";
"Select\nbundled\npresets" = "Seleziona\npreset\ninclusi";
"Themes:\n%s" = "Temi:\n%s";



// MARK: - Voice Commands phrases
"Play some music in Modizer" = "Riproduci musica in Modizer";
"Start random playlist in Modizer" = "Avvia playlist casuale in Modizer";
"Play favorites in Modizer" = "Riproduci preferiti in Modizer";
"Start favorites playlist in Modizer" = "Avvia playlist preferiti in Modizer";
"Play most played in Modizer" = "Riproduci più riprodotti in Modizer";
"Start most played playlist in Modizer" = "Avvia playlist più riprodotti in Modizer";
"Play a playlist in Modizer" = "Riproduci una playlist in Modizer";
"Start a playlist in Modizer" = "Avvia una playlist in Modizer";
"Toggle shuffle mode in Modizer" = "Attiva modalità casuale in Modizer";
"Change shuffle mode in Modizer" = "Cambia shuffle in Modizer";
"Change loop mode in Modizer" = "Cambia modalità ripetizione in Modizer";
"Toggle repeat in Modizer" = "Attiva ripeti in Modizer";
"What's playing in Modizer" = "Cosa sta suonando in Modizer";
"Current song in Modizer" = "Brano corrente in Modizer";

"Voices commands aren't supported in MacOS." = "I comandi vocali non sono supportati su macOS.";

/* Error messages */
"playlist_not_found_error" = "Playlist non trovata. Usa 'Ottieni playlist' per vedere le playlist disponibili.";
"playlist_empty_error" = "Questa playlist non contiene brani. Aggiungi prima della musica.";
